"""
В фермерском хозяйстве в Карелии выращивают чернику. Она растет на
круглой грядке, причем кусты высажены только по окружности. Таким образом, у
каждого куста есть ровно два соседних. Всего на грядке растет N кустов.
Эти кусты обладают разной урожайностью, поэтому ко времени сбора на них
выросло различное число ягод – на i-ом кусте выросло ai ягод.
В этом фермерском хозяйстве внедрена система автоматического сбора черники.
Эта система состоит из управляющего модуля и нескольких собирающих модулей.
Собирающий модуль за один заход, находясь непосредственно перед некоторым
кустом, собирает ягоды с этого куста и с двух соседних с ним.
Напишите программу для нахождения максимального числа ягод, которое может
собрать за один заход собирающий модуль, находясь перед некоторым кустом
заданной во входном файле грядки.
"""
# Инициализация данных:
n = int(input('Сколько кустов на грядке? '))
while n < 3:
    n = int(input('Кустов должно быть больше 3! Введите число: '))
print('Сколько ягод выросло на каждом кусте?')
bushes = [int(input(f'{number}: ')) for number, _ in enumerate(range(n), 1)]

max_collected = 0  # Максимальное число ягод, которое может быть собрано с 3-х кустов
max_index = 0  # Индекс первого из кустов, с которых может быть собрано макс. количество ягод
for i in range(n):
    # По очереди перебираем комбинации 3-х соседних кустов и определяем сумму собранных ягод:
    collected = bushes[(n - 1 + i) % n] + bushes[(n + i) % n] + bushes[(n + 1 + i) % n]
    if collected > max_collected:
        max_collected = collected
        max_index = i
# Определяем номера кустов, с которых было собрано максимальное количество ягод (отличаются от индексов)
max_bushes = ((n - 1 + max_index) % n + 1, (n + max_index) % n + 1, (n + 1 + max_index) % n + 1)

print(f'Максимальное количество ягод, которое может быть собрано с трех кустов: {max_collected}.')
print(f'Кусты {max_bushes[0]}, {max_bushes[1]} и {max_bushes[2]}')
